justimepassnow/custom_servo/mm32_test/src/main.c
                            if (update_mask & (1 << 0)) {
                                new_cfg.servo_id = rx_params[1] & 0x7F; // Extract 7-bit ID
                                new_cfg.direction_invert = (rx_params[1] >> 7) & 0x01; // Extract MSB as direction invert flag
                            }
                            if (update_mask & (1 << 1)) {
                                new_cfg.min_angle = rx_params[2] | (rx_params[3] << 8);
                                new_cfg.max_angle = rx_params[4] | (rx_params[5] << 8);
                            }
                            if (update_mask & (1 << 2)) {
                                new_cfg.max_velocity = rx_params[6] | (rx_params[7] << 8);
                            }
                            if (update_mask & (1 << 3)) {
                                new_cfg.current_limit = rx_params[8] | (rx_params[9] << 8);
                            }
                            if (update_mask & (1 << 4)) {
                                new_cfg.kp_q16 = rx_params[10] | (rx_params[11] << 8) | (rx_params[12] << 16) | (rx_params[13] << 24);
                                new_cfg.ki_q16 = rx_params[14] | (rx_params[15] << 8) | (rx_params[16] << 16) | (rx_params[17] << 24);
                                new_cfg.kd_q16 = rx_params[18] | (rx_params[19] << 8) | (rx_params[20] << 16) | (rx_params[21] << 24);
                            }
                            if (update_mask & (1 << 5)) {
                                new_cfg.hard_min_angle = rx_params[22] | (rx_params[23] << 8);
                                new_cfg.hard_max_angle = rx_params[24] | (rx_params[25] << 8);
                            }
                            if (update_mask & (1 << 7)) {
                                new_cfg.hard_min_adc = rx_params[26] | (rx_params[27] << 8);
                                new_cfg.hard_max_adc = rx_params[28] | (rx_params[29] << 8);
                            }
                            
                            // Bit 6: Volatile (RAM-only) update flag
                            if (!(update_mask & (1 << 6))) {
                                flash_write_config(&new_cfg);
                            }
                            config = new_cfg;
                            Kp_q16 = config.kp_q16;
                            Ki_q16 = config.ki_q16;
                            Ki_scaled_q16 = (config.ki_q16 * 16777) >> 24;
                            Kd_q16 = config.kd_q16;
                            
                            int32_t sweep = config.hard_max_angle - config.hard_min_angle;
                            int32_t adc_range = config.hard_max_adc - config.hard_min_adc;
                            if (adc_range <= 0) adc_range = 1;
                            adc_to_angle_mult_q16 = (sweep << 16) / adc_range;
                            
                            if (rx_id != 0xFE) {
                                pending_reply_cmd = 0x02;
                                reply_trigger_time_ms = millis() + 2;
                            }
                        } 
                        // 3. POLL_STATUS Command
                        else if (rx_instruction == 0x03) {
                            if (rx_id != 0xFE) {
                                pending_reply_cmd = 0x03;
                                reply_trigger_time_ms = millis() + 2;
                            }
                        } 
                        // 4. CLEAR_ERROR Command
                        else if (rx_instruction == 0x04) {
                            if (rx_params[0] == 1) { // 1 = Clear Error
                                overcurrent_fault = 0;
                                overcurrent_ms = 0;
                                pid_integral = 0;
                                prev_error = 0;
                                motor_armed = 0; // Disarm motor to allow manual shaft positioning!
                                target_angle = current_angle;
                                ghost_angle_q8 = current_angle << 8;
                                
                                if (rx_id != 0xFE) {
                                    pending_reply_cmd = 0x04;
                                    reply_trigger_time_ms = millis() + 2;
                                }
                            }
                        }
                        // 5. READ_CONFIG Command
                        else if (rx_instruction == 0x05) {
                            if (rx_id != 0xFE) {
                                pending_reply_cmd = 0x05;
                                reply_trigger_time_ms = millis() + 2;
                            }
                        }

                    }
                    rx_state = RX_STATE_HEADER1;
                }
                break;
        }
    } else {
        // Clear any stray error flags (ORE, NE, FE, PE) that could cause an infinite IRQ loop
        (void)USART_ReceiveData(USART1);
    }
}

// PID Controller Loop
static inline void pid_update(uint32_t arr_period) {
    if (overcurrent_fault) {
        TIM_SetCompare3(TIM1, 0);
        TIM_SetCompare2(TIM1, 0);
        return;
    }

    if (!motor_armed) {
        TIM_SetCompare3(TIM1, 0);
        TIM_SetCompare2(TIM1, 0);
        return;
    }

    // 3. Compute error relative to the Ghost Target
    pid_error = ghost_angle_q8 - current_angle_q8;

    // 4. Check Deadband (only when Ghost Target has fully caught up to final target)
    if (ghost_angle_q8 == (target_angle << 8)) {
        int32_t abs_error = (pid_error >= 0) ? pid_error : -pid_error;
        if (abs_error < DEADBAND_Q8) {
            // Idle state: hold both inputs HIGH (100% duty) for active braking/slow decay
            TIM_SetCompare3(TIM1, arr_period);
            TIM_SetCompare2(TIM1, arr_period);
            pid_integral = 0;
            prev_error = 0;
            if (status_reporting_enabled) {
                status_reporting_enabled = 0;
#if DEBUG_LOG
                print_status();
                uart_print("[STATUS] Target reached! Motor is now idle.\r\n");
#endif
            }
            return;
        } else {
            // Actively tracking outside the deadband, so we are still moving
            status_reporting_enabled = 1;
        }
    }

    // 5. Calculate P, I, D outputs using Q24 scaling
    int64_t p_term = (int64_t)Kp_q16 * (int64_t)pid_error;

