justimepassnow/custom_servo/mm32_test/src/main.c
    pid_integral += pid_error;
    if (pid_integral > INTEGRAL_LIMIT_Q8) pid_integral = INTEGRAL_LIMIT_Q8;
    else if (pid_integral < -INTEGRAL_LIMIT_Q8) pid_integral = -INTEGRAL_LIMIT_Q8;
    
    int64_t i_term = (int64_t)Ki_scaled_q16 * (int64_t)pid_integral;

    pid_derivative = pid_error - prev_error;
    prev_error = pid_error;
    
    int64_t d_term = (int64_t)Kd_q16 * (int64_t)pid_derivative * 1000;

    int64_t pid_out_q24 = p_term + i_term + d_term;
    int32_t pid_out = (int32_t)(pid_out_q24 >> 24);

    // 6. Direct PWM generation
    int32_t pulse = (pid_out >= 0) ? pid_out : -pid_out;
    if (pulse > (int32_t)arr_period) {
        pulse = (int32_t)arr_period;
    }

    int8_t drive_direction = (pid_out >= 0) ? 1 : -1;
    if (config.direction_invert) {
        drive_direction = -drive_direction; // Swap effective direction
    }

    if (drive_direction > 0) {
        // Forward Direction (IN1 [CH3] = 100% High, IN2 [CH2] = Inverted PWM)
        TIM_SetCompare3(TIM1, arr_period);
        TIM_SetCompare2(TIM1, arr_period - pulse);
    } else {
        // Backward Direction (IN1 [CH3] = Inverted PWM, IN2 [CH2] = 100% High)
        TIM_SetCompare3(TIM1, arr_period - pulse);
        TIM_SetCompare2(TIM1, arr_period);
    }
}



// 1ms Critical Task Loop (Trajectory Ramping, Protection Checks & State Machine)
static inline void one_ms_task(uint32_t arr_period) {
    // 1. Read potentiometer raw ADC and apply low pass filter (updates current_angle_q8 and current_angle)
    static int32_t filtered_adc_q8 = -1;
    uint16_t raw_adc = adc_read(ADC_Channel_7);
    int32_t raw_adc_q8 = ((int32_t)raw_adc) << 8;
    if (filtered_adc_q8 < 0) {
        filtered_adc_q8 = raw_adc_q8;
    } else {
        // alpha = 0.10 -> Q8 equivalent is 26/256 for smooth PID control
        filtered_adc_q8 = (26 * raw_adc_q8 + 230 * filtered_adc_q8) >> 8;
    }

    int32_t active_adc_q8 = filtered_adc_q8 - (config.hard_min_adc << 8);
    
    if (config.direction_invert) {
        current_angle_q8 = (config.hard_max_angle << 8) - (int32_t)(((int64_t)active_adc_q8 * adc_to_angle_mult_q16) >> 16);
    } else {
        current_angle_q8 = (int32_t)(((int64_t)active_adc_q8 * adc_to_angle_mult_q16) >> 16) + (config.hard_min_angle << 8);
    }
    current_angle = (current_angle_q8 + 128) >> 8;

    // 2. Over-Current Protection
    int32_t current_ma = read_current_ma();
    if (current_ma > (int32_t)config.current_limit) {
        overcurrent_ms++;
        if (overcurrent_ms >= 50) {
            overcurrent_fault = 1;
            TIM_SetCompare3(TIM1, 0);
            TIM_SetCompare2(TIM1, 0);
            return;
        }
    } else {
        overcurrent_ms = 0;
    }

    // 0. Safety Check
    if (overcurrent_fault) {
        TIM_SetCompare3(TIM1, 0);
        TIM_SetCompare2(TIM1, 0);
        return;
    }

    // 3. Normal trajectory ramping and PID execution
    ghost_angle_q8 = target_angle << 8;
    
    pid_update(arr_period);
}

// Telemetry output logger
void print_status(void) {
    uart_print("[STATUS] Target: ");
    uart_print_int(target_angle);
    uart_print(" deg | Current: ");
    uart_print_int(current_angle);
    uart_print(" deg | Error: ");
    
    int32_t err = target_angle - current_angle;
    if (err < 0) {
        uart_print("-");
        uart_print_int(-err);
    } else {
        uart_print_int(err);
    }
    
    uart_print(" deg | Current Draw: ");
    uart_print_int(read_current_ma());
    uart_print(" mA | Duty: ");
    
    uint32_t pulse3 = TIM1->CCR3;
    uint32_t pulse2 = TIM1->CCR2;
    uint32_t arr = TIM1->ARR;
    if (arr == 0) arr = 1;
    
    if (pulse3 > 0) {
        uart_print_int((pulse3 * 100) / arr);
        uart_print("% (PA6 Forward)\r\n");
    } else if (pulse2 > 0) {
        uart_print_int((pulse2 * 100) / arr);
        uart_print("% (PA8 Backward)\r\n");
    } else {
        uart_print("0% (Idle/Deadband)\r\n");
    }
}

void calibrate_current_sensor(void) {
    int32_t sum = 0;
    // Take 16 quick sequential readings to calculate a clean average offset
    for (int i = 0; i < 16; i++) {
        sum += adc_read(ADC_Channel_5); // PA2 maps to ADC1_VIN[5]
        delay_ms(1);
    }
    zero_current_offset_adc = sum / 16;
    
#if DEBUG_LOG
    uart_print("Current Sensor Baseline Calibrated. Zero-Offset: ");
    uart_print_int(zero_current_offset_adc);
    uart_print(" raw ADC counts.\r\n");
#endif
}

int main(void) {
    GPIO_InitTypeDef        GPIO_InitStruct;
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStruct;
    TIM_OCInitTypeDef       TIM_OCInitStruct;

    // 1. Enable 1ms SysTick timekeeping interrupt
    SysTick_Config(SystemCoreClock / 1000);

    // 2. Initialize Single-Wire Half-Duplex USART1 at 115200 Baud
    uart_init();
#if DEBUG_LOG
    uart_print("\n--- Smart Servo Overhauled Firmware Init ---\n");
#endif

    // 3. Load or initialize Flash Persistent Parameters
    flash_load_config(&config);
#if DEBUG_LOG
    uart_print("Flash Loaded Configuration ID: ");
    uart_print_int(config.servo_id);
    uart_print("\r\n");
#endif

    // 4. Initialize TIM1 and GPIOA
    RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_TIM1, ENABLE);
    RCC_AHBPeriphClockCmd(RCC_AHBPERIPH_GPIOA, ENABLE);

    // 5. Configure TIM1 base for 20kHz motor PWM
    uint32_t TimerClock = TIM_GetTIMxClock(TIM1);
    uint32_t TargetFrequency = 20000;
    uint32_t TimerPeriod = (TimerClock / TargetFrequency) - 1;

    TIM_TimeBaseStructInit(&TIM_TimeBaseStruct);
    TIM_TimeBaseStruct.TIM_Prescaler         = 0;
    TIM_TimeBaseStruct.TIM_CounterMode       = TIM_CounterMode_Up;
    TIM_TimeBaseStruct.TIM_Period            = TimerPeriod;
    TIM_TimeBaseStruct.TIM_ClockDivision     = TIM_CKD_Div1;
    TIM_TimeBaseStruct.TIM_RepetitionCounter = 0;
    TIM_TimeBaseInit(TIM1, &TIM_TimeBaseStruct);

    // 6. Initialize TIM1 CH3 and CH2 output channels
    TIM_OCStructInit(&TIM_OCInitStruct);
    TIM_OCInitStruct.TIM_OCMode       = TIM_OCMode_PWM1;
    TIM_OCInitStruct.TIM_OutputState  = TIM_OutputState_Enable;
    TIM_OCInitStruct.TIM_Pulse        = 0;
    TIM_OCInitStruct.TIM_OCPolarity   = TIM_OCPolarity_High;
    TIM_OCInitStruct.TIM_OCIdleState  = TIM_OCIdleState_Set;
    TIM_OC3Init(TIM1, &TIM_OCInitStruct); // Channel 3 (PA6)
    TIM_OC2Init(TIM1, &TIM_OCInitStruct); // Channel 2 (PA8)

    // 7. Configure pin AF multiplexing
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource6, GPIO_AF_4);
    GPIO_PinAFConfig(GPIOA, GPIO_PinSource8, GPIO_AF_1);

    // 8. Configure Alternate Function push-pull pins for PWM channels
    GPIO_StructInit(&GPIO_InitStruct);
    GPIO_InitStruct.GPIO_Pin   = GPIO_Pin_6 | GPIO_Pin_8;
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_High;
    GPIO_InitStruct.GPIO_Mode  = GPIO_Mode_AF_PP;
    GPIO_Init(GPIOA, &GPIO_InitStruct);

