justimepassnow/custom_servo/mm32_test/src/main.c
    // 9. Configure Software Reset button on PA5
    GPIO_StructInit(&GPIO_InitStruct);
    GPIO_InitStruct.GPIO_Pin   = GPIO_Pin_5;
    GPIO_InitStruct.GPIO_Speed = GPIO_Speed_High;
    GPIO_InitStruct.GPIO_Mode  = GPIO_Mode_IPU;
    GPIO_Init(GPIOA, &GPIO_InitStruct);

    // 10. Initialize ADC on PA7 and PA2
    adc_init();

    // Calibrate current sensor baseline offset (Auto-Zeroing)
    calibrate_current_sensor();

    // 11. Enable TIM1 Main Outputs
    TIM_Cmd(TIM1, ENABLE);
    TIM_CtrlPWMOutputs(TIM1, ENABLE);

    // 12. Soft Start: read current position to lock initial target securely
    uint16_t init_raw_adc = adc_read(ADC_Channel_7);
    int32_t sweep = config.hard_max_angle - config.hard_min_angle;
    int32_t adc_range = config.hard_max_adc - config.hard_min_adc;
    if (adc_range <= 0) adc_range = 1;
    
    int32_t init_active_adc = (int32_t)init_raw_adc - config.hard_min_adc;
    int32_t init_angle_q8;
    
    if (config.direction_invert) {
        init_angle_q8 = (config.hard_max_angle << 8) - (sweep * init_active_adc * 256) / adc_range;
    } else {
        init_angle_q8 = (sweep * init_active_adc * 256) / adc_range + (config.hard_min_angle << 8);
    }
    current_angle_q8 = init_angle_q8;
    current_angle = (init_angle_q8 + 128) >> 8;
    target_angle = current_angle;
    ghost_angle_q8 = init_angle_q8;
    active_velocity = config.max_velocity;

#if DEBUG_LOG
    uart_print("Soft-Start Complete. Locked Initial Angle: ");
    uart_print_int(current_angle);
    uart_print(" deg.\r\n");
#endif

    uint32_t last_tick = ms_ticks;

    while (1) {
        // A. Software System Reset Trigger (Debounced reset button on PA5)
        if (GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_5) == Bit_RESET) {
#if DEBUG_LOG
            uart_print("\r\n[RESET] Triggering Software Reset...\r\n");
#endif
            delay_ms(50);
            NVIC_SystemReset();
        }

        // B. (UART RX is now handled asynchronously by USART1_IRQHandler)
        
        // C. Send asynchronous TX replies safely without blocking the CPU
        if (pending_reply_cmd != 0 && millis() >= reply_trigger_time_ms) {
            if (pending_reply_cmd == 0x05) {
                send_config_reply();
            } else {
                send_status_reply(pending_reply_cmd);
            }
            pending_reply_cmd = 0;
        }

        // D. Update Trajectory ramps, protections, and PID loop strictly every 1ms
        if (ms_ticks != last_tick) {
            last_tick = ms_ticks;
            one_ms_task(TimerPeriod);
        }
    }
}
